crates/protocol-winrm/tests/resources/resource_created.xml

<s:Envelope xml:lang="en-US"
    xmlns:s="http://www.w3.org/2003/05/soap-envelope"
    xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:x="http://schemas.xmlsoap.org/ws/2004/09/transfer"
    xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
    xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell"
    xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd">
    <s:Header>
        <a:Action>
                http://schemas.xmlsoap.org/ws/2004/09/transfer/CreateResponse
        </a:Action>
        <a:MessageID>
                uuid:E17CCBB8-6136-4FA1-95B2-0DEF618A9232
        </a:MessageID>
        <p:OperationID s:mustUnderstand="false">
                uuid:73C4BCA6-7FF0-4AFE-B8C3-335FB19BA649
        </p:OperationID>
        <p:SequenceId>
                1
        </p:SequenceId>
        <a:To>
                http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous
        </a:To>
        <a:RelatesTo>
                uuid:D1D65143-B634-4725-BBF6-869CC4D3062F
        </a:RelatesTo>
    </s:Header>
    <s:Body>
        <x:ResourceCreated>
            <a:Address> http://10.10.0.3:5985/wsman?PSVersion=7.4.10
            </a:Address>
            <a:ReferenceParameters>
                <w:ResourceURI>
                        http://schemas.microsoft.com/powershell/Microsoft.PowerShell
                </w:ResourceURI>
                <w:SelectorSet>
                    <w:Selector Name="ShellId">
                            2D6534D0-6B12-40E3-B773-CBA26459CFA8
                    </w:Selector>
                </w:SelectorSet>
            </a:ReferenceParameters>
        </x:ResourceCreated>
        <rsp:Shell xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell">
            <rsp:ShellId>
                    2D6534D0-6B12-40E3-B773-CBA26459CFA8
            </rsp:ShellId>
            <rsp:Name>
                    Runspace1
            </rsp:Name>
            <rsp:ResourceUri>
                    http://schemas.microsoft.com/powershell/Microsoft.PowerShell
            </rsp:ResourceUri>
            <rsp:Owner>
                    administrator
            </rsp:Owner>
            <rsp:ClientIP>
                    10.10.0.1
            </rsp:ClientIP>
            <rsp:ProcessId>
                    5812
            </rsp:ProcessId>
            <rsp:IdleTimeOut>
                    PT7200.000S
            </rsp:IdleTimeOut>
            <rsp:InputStreams>
                    stdin pr
            </rsp:InputStreams>
            <rsp:OutputStreams>
                    stdout
            </rsp:OutputStreams>
            <rsp:MaxIdleTimeOut>
                    PT2147483.647S
            </rsp:MaxIdleTimeOut>
            <rsp:Locale>
                    en-US
            </rsp:Locale>
            <rsp:DataLocale>
                    en-CA
            </rsp:DataLocale>
            <rsp:CompressionMode>
                    XpressCompression
            </rsp:CompressionMode>
            <rsp:ProfileLoaded>
                    Yes
            </rsp:ProfileLoaded>
            <rsp:Encoding>
                    UTF8
            </rsp:Encoding>
            <rsp:BufferMode>
                    Block
            </rsp:BufferMode>
            <rsp:State>
                    Connected
            </rsp:State>
            <rsp:ShellRunTime>
                    P0DT0H0M0S
            </rsp:ShellRunTime>
            <rsp:ShellInactivity>
                    P0DT0H0M0S
            </rsp:ShellInactivity>
        </rsp:Shell>
    </s:Body>
</s:Envelope>
